In [ ]:
# MYSQL 설치 후 기본 문법



1. mysql commend line client 실행

2. enter password: oracle ( 자기 비밀번호 )

3. create database orcl ( DB 이름 )

4. use orcl

5. 자기가 갖고 있는 테이블 쿼리문 입력

6. 테이블 확인

select * from emp;

In [ ]:
# 오라클과 MYSQL 함수 비교



        오라클       ---      MYSQL

1.       nvl                  ifnull

2.     sysdate              sysdate()

3. months_between          group_concat

4.    decode                   if

5.    rollup                with rollup

6.    listagg             group_concat

In [ ]:
예제 : 이름, 커미션을 출력하는데 커미션이 null인 사람은 0으로 출력하기

select ename, ifnull(comm,0)

 from emp;
    
예제 : 오늘 날짜를 출력하기

select sysdate();


* MYSQL은 dual이 없다.

예제 : 부서 번호별 토탈 월급을 출력하는데 맨 아래에 전체 월급이 출력되게 하기

select deptno, sum(sal)

 from emp

 group by deptno with rollup;

# group_concat을 이용해서

예제 : 부서번호, 부서번호별 사원들의 이름을 가로로 출력하기

select deptno, group_concat(ename)

from emp

group by deptno;

In [ ]:
#########지금부터 가장 중요###########

# scott의 월급을 0으로 변경하기

update emp

set sal=0

where ename='scott';

# 다시 rollback 하고 월급 확인하기

rollback;

select ename, sal

 from emp

 where ename='scott';

***** mysql은 오라클과 다르게 기본 자동 commit이 활성화 되어있다.

그래서 자동 commit 때문에 rollback도 할 수 없다 ******

In [ ]:
# 자동 커밋 활성화 확인하기

select @@autocommit;

* 1이면 on, 0이면 off 상태이다.



# 자동 커밋 비활성화 후 확인



set autocommit = FALSE;

select @@autocommit;

# 비활성화 후 king의 월급을 0으로 바꾸고, rollback 해보기

update emp

set sal=0

where ename='king';


select ename,sal

from emp

where ename='king';

rollback;


select ename,sal

from emp

where ename='king';

In [ ]:
# MYSQL과 파이썬 연동하기

1. 아나콘다 프롬프트 창을 열고, pymysql 패키지를 설치

2. conda install pymysql 입력

3. pymysql 활용한 코드

In [1]:
# 예제 : emp 테이블에서 사원 이름과 월급 출력하기

import pymysql

import pandas as pd
conn = pymysql.connect(host="localhost", user="root",password="oracle", db="orcl",charset="utf8")
curs = conn.cursor()
sql = "select * from emp"
curs.execute(sql)
rows = curs.fetchall()
colname = curs.description
col = []
for i in colname:
    col.append(i[0].upper())
emp = pd.DataFrame(list(rows),columns=col)
print(emp[['ENAME', 'SAL']] )

     ENAME   SAL
0     KING  5000
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5   TURNER  1500
6    JAMES   950
7     WARD  1250
8     FORD  3000
9    SMITH   800
10   SCOTT     0
11   ADAMS  1100
12  MILLER  1300

In [2]:
# 예제 : 직업별 토탈 월급 출력하기

import pymysql

import pandas as pd
conn = pymysql.connect(host="localhost", user="root",password="oracle", db="orcl",charset="utf8")
curs = conn.cursor()
sql = "select job, sum(sal) from emp group by job"
curs.execute(sql)
rows = curs.fetchall()
colname = curs.description
col = []
for i in colname:
    col.append(i[0].upper())
emp = pd.DataFrame(list(rows),columns=col)
print(emp)

         JOB SUM(SAL)
0  PRESIDENT     5000
1    MANAGER     8275
2   SALESMAN     4000
3      CLERK     4150
4    ANALYST     3000